0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
464400
(
2e+06
2e+06
2e+06
2e+06
2e+06
2e+06
2e+06
2e+06
...
)
;

boundaryField
{
    symmetry_1-driver
    {
        type            symmetryPlane;
    }
    symmetry_1-driven
    {
        type            symmetryPlane;
    }
    symmetry_2-driver
    {
        type            symmetryPlane;
    }
    symmetry_2-driven
    {
        type            symmetryPlane;
    }
    wall-driver
    {
        type            zeroGradient;
    }
    wall-driven
    {
        type            zeroGradient;
    }
    contact_region-src
    {
        type            cyclicAMI;
        value           uniform 2e+06;
    }
    contact_region-trg
    {
        type            cyclicAMI;
        value           uniform 2e+06;
    }
    contact_region_2-src
    {
        type            cyclicAMI;
        value           uniform 2e+06;
    }
    contact_region_2-trg
    {
        type            cyclicAMI;
        value           uniform 2e+06;
    }
    contact_region_3-src
    {
        type            cyclicAMI;
        value           uniform 2e+06;
    }
    contact_region_3-trg
    {
        type            cyclicAMI;
        value           uniform 100000;
    }
    contact_region_4-src
    {
        type            cyclicAMI;
        value           uniform 2e+06;
    }
    contact_region_4-trg
    {
        type            cyclicAMI;
        value           uniform 100000;
    }
    contact_region_5-src
    {
        type            cyclicAMI;
        value           uniform 100000;
    }
    contact_region_5-trg
    {
        type            cyclicAMI;
        value           uniform 100000;
    }
}


// ************************************************************************* //
